---
kind: property
id: P:Autodesk.Revit.DB.Dimension.HasLeader
zh: 尺寸标注、标注
source: html/f37b29fc-4ea1-604f-25f4-182a66764251.htm
---
# Autodesk.Revit.DB.Dimension.HasLeader Property

**中文**: 尺寸标注、标注

True if dimension has leader, false otherwise.

## Syntax (C#)
```csharp
public bool HasLeader { get; set; }
```